{
  "meta": {
    "id": "story_1766770401762_ilicwq06j",
    "title_es": "Un Día de Juegos con Nuevos Amigos",
    "title_en": "A Playdate with New Friends",
    "level": "A1",
    "tags": [
      "amistad",
      "aprendizaje",
      "juegos",
      "robot",
      "parque"
    ],
    "characters": [
      "Owen",
      "Plock"
    ],
    "date_created": "2025-12-26T17:33:21.762Z"
  },
  "content": [
    {
      "es": "Owen es un chico muy curioso. Él quiere aprender español. Su amigo robot, Plock, siempre está listo para nuevas aventuras.",
      "en": "Owen is a very curious boy. He wants to learn Spanish. His robot friend, Plock, is always ready for new adventures."
    },
    {
      "es": "Hoy es un día soleado. Owen y Plock van al parque. '¡Mira, Plock! Hay muchos niños aquí', dice Owen.",
      "en": "Today is a sunny day. Owen and Plock go to the park. 'Look, Plock! There are many children here,' Owen says."
    },
    {
      "es": "Dos niños juegan con una pelota roja. Se llaman Leo y Mia. Owen es un poco tímido, pero Plock le da una idea.",
      "en": "Two children play with a red ball. Their names are Leo and Mia. Owen is a little shy, but Plock gives him an idea."
    },
    {
      "es": "'¡Hola! ¿Cómo están?', dice Owen con una sonrisa. Leo y Mia miran a Owen y Plock. Ellos dicen: '¡Hola!'",
      "en": "'Hello! How are you?', Owen says with a smile. Leo and Mia look at Owen and Plock. They say: 'Hello!'"
    },
    {
      "es": "Owen, Plock, Leo y Mia juegan juntos. La pelota es roja. '¡Rojo!', dice Plock. Owen aprende la palabra nueva.",
      "en": "Owen, Plock, Leo, and Mia play together. The ball is red. 'Red!', Plock says. Owen learns the new word."
    },
    {
      "es": "Después, ellos se sientan en el césped verde. Comparten galletas. Owen dice: 'Mi color favorito es azul'.",
      "en": "Afterward, they sit on the green grass. They share cookies. Owen says: 'My favorite color is blue'."
    },
    {
      "es": "Leo y Mia son muy amables. Owen está feliz. ¡Tiene nuevos amigos! Aprender español es divertido con amigos.",
      "en": "Leo and Mia are very kind. Owen is happy. He has new friends! Learning Spanish is fun with friends."
    },
    {
      "es": "Owen y Plock regresan a casa. Owen piensa: '¡Quiero más días así!'. Plock responde: '¡Sí, Owen! ¡Más aventuras!'",
      "en": "Owen and Plock return home. Owen thinks: 'I want more days like this!'. Plock responds: 'Yes, Owen! More adventures!'"
    }
  ],
  "vocab": [
    {
      "es": "curioso",
      "en": "curious"
    },
    {
      "es": "aprender",
      "en": "to learn"
    },
    {
      "es": "parque",
      "en": "park"
    },
    {
      "es": "jugar",
      "en": "to play"
    },
    {
      "es": "pelota",
      "en": "ball"
    },
    {
      "es": "rojo",
      "en": "red"
    },
    {
      "es": "amigos",
      "en": "friends"
    },
    {
      "es": "feliz",
      "en": "happy"
    },
    {
      "es": "hola",
      "en": "hello"
    },
    {
      "es": "césped",
      "en": "grass"
    },
    {
      "es": "verde",
      "en": "green"
    },
    {
      "es": "azul",
      "en": "blue"
    }
  ],
  "grammar_note": "This story uses the present tense of common verbs like 'ser' (to be) and 'ir' (to go) for actions happening now or general truths. For example, 'Owen es un chico' (Owen is a boy) uses 'ser' to describe who Owen is. 'Ellos van al parque' (They go to the park) uses 'ir' to describe movement. We also see basic questions like '¿Cómo están?' (How are you?)."
}