{
  "meta": {
    "id": "story_1766770343417_sy2q4jooy",
    "title_es": "La Gran Búsqueda de Comida",
    "title_en": "The Great Grocery Hunt",
    "level": "A1",
    "tags": [
      "aventura",
      "comida",
      "amigos",
      "aprender",
      "supermercado"
    ],
    "characters": [
      "Owen",
      "Plock"
    ],
    "date_created": "2025-12-26T17:32:23.417Z"
  },
  "content": [
    {
      "es": "Owen y Plock van al supermercado. Es una gran aventura para ellos. Owen quiere aprender español. Plock es su amigo robot.",
      "en": "Owen and Plock go to the supermarket. It is a big adventure for them. Owen wants to learn Spanish. Plock is his robot friend."
    },
    {
      "es": "La lista de compras es un poco larga. Plock dice: \"¡Primero, busca tres manzanas rojas!\" Owen mira por todas partes.",
      "en": "The shopping list is a little long. Plock says: \"First, look for three red apples!\" Owen looks everywhere."
    },
    {
      "es": "\"¡Ahí están!\" dice Owen. \"Son grandes y muy rojas. ¡Uno, dos, tres manzanas!\" Plock sonríe. \"¡Muy bien, Owen!\"",
      "en": "\"There they are!\" says Owen. \"They are big and very red. One, two, three apples!\" Plock smiles. \"Very good, Owen!\""
    },
    {
      "es": "Luego, Plock dice: \"Ahora, necesitamos cuatro plátanos verdes.\" Owen busca los plátanos. \"¡Aquí están! Son bonitos y verdes.\"",
      "en": "Then, Plock says: \"Now, we need four green bananas.\" Owen looks for the bananas. \"Here they are! They are pretty and green.\""
    },
    {
      "es": "\"¡Fantástico!\" dice Plock. \"Busca dos cajas de leche azul.\" Owen camina rápido. \"¡Encontré la leche! Es azul y fresca.\"",
      "en": "\"Fantastic!\" says Plock. \"Look for two blue milk cartons.\" Owen walks fast. \"I found the milk! It is blue and fresh.\""
    },
    {
      "es": "El último artículo es queso amarillo. Plock pregunta: \"¿Dónde está el queso?\" Owen sonríe y señala. \"¡Mira! Está aquí. Es un queso grande y amarillo.\"",
      "en": "The last item is yellow cheese. Plock asks: \"Where is the cheese?\" Owen smiles and points. \"Look! It is here. It is a big, yellow cheese.\""
    },
    {
      "es": "\"¡Lo tenemos todo!\" dice Owen, muy feliz. Plock dice: \"¡Buen trabajo, Owen! ¡Eres un gran buscador y aprendes mucho español!\"",
      "en": "\"We have everything!\" says Owen, very happy. Plock says: \"Good job, Owen! You are a great seeker and you learn a lot of Spanish!\""
    },
    {
      "es": "Owen y Plock son los mejores amigos. Ellos aprenden, se divierten y siempre tienen nuevas aventuras juntos. ¡Aprender es divertido!",
      "en": "Owen and Plock are the best friends. They learn, have fun, and always have new adventures together. Learning is fun!"
    }
  ],
  "vocab": [
    {
      "es": "supermercado",
      "en": "supermarket"
    },
    {
      "es": "manzana",
      "en": "apple"
    },
    {
      "es": "plátano",
      "en": "banana"
    },
    {
      "es": "leche",
      "en": "milk"
    },
    {
      "es": "queso",
      "en": "cheese"
    },
    {
      "es": "rojo",
      "en": "red"
    },
    {
      "es": "verde",
      "en": "green"
    },
    {
      "es": "azul",
      "en": "blue"
    },
    {
      "es": "amarillo",
      "en": "yellow"
    },
    {
      "es": "buscar",
      "en": "to look for"
    }
  ],
  "grammar_note": "In this story, you can see two key A1 grammar concepts: 1. Adjective Agreement: In Spanish, adjectives (like colors and descriptions) match the noun's gender and number. For example, 'manzanas rojas' (red apples - feminine, plural) and 'plátanos verdes' (green bananas - masculine, plural). 2. The verb 'Ser' (to be): We use 'ser' for permanent characteristics or identity. Examples from the story are 'Plock es su amigo' (Plock is his friend) and 'Son grandes' (They are big)."
}